Tekla Open API Reference for Tekla Structures 2025
Model.GetIdentifierByGUID Method
 Returns an identifier instance that has the given GUID in the model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier GetIdentifierByGUID(
	string guid
)
Public Function GetIdentifierByGUID (
	guid As String
) As Identifier
Parameters
guid
Type: System.String
The GUID to look for in the model.
Return Value
Type: Identifier
The identifier of the GUID, or null if not found.
See Also
Reference
Model Class
Tekla.Structures.Model Namespace